docs/benchmark-results/sync-vs-async/raw/stage0-async-nobatch-k6-logs/insert-only-vu400.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 25 iterations for each of 400 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=168\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=185\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=211\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=62\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=221\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=207\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=244\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=40\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=247\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=228\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=261\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=31\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=38\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=212\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=129\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=233\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=39\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=33\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=234\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=215\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=264\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=370\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=240\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=223\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=213\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=230\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=131\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=197\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=232\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=209\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=231\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=214\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=249\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=242\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=192\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=218\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=258\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=37\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=262\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=226\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=130\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=167\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=227\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=245\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=216\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=263\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=236\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=68\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=229\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=237\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=196\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=235\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=239\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=204\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=224\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=259\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=208\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=127\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=63\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=222\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=220\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=243\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=238\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=65\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=217\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=219\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=34\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=260\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=200\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=255\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=194\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=179\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=201\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=41\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=176\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=210\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:20:13+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=225\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=13.44ms min=0s med=11.04ms max=86.6ms   p(90)=26.38ms p(95)=35.37ms
      { expected_response:true }...: avg=13.54ms min=0s med=11.04ms max=86.6ms   p(90)=26.44ms p(95)=35.61ms
    http_req_failed................: 0.77%  77 out of 10000
    http_reqs......................: 10000  21760.531444/s

    EXECUTION
    iteration_duration.............: avg=16.41ms min=0s med=12.17ms max=117.24ms p(90)=30.68ms p(95)=42.08ms
    iterations.....................: 10000  21760.531444/s

    NETWORK
    data_received..................: 724 kB 1.6 MB/s
    data_sent......................: 1.4 MB 3.1 MB/s



running (00m00.5s), 000/400 VUs, 10000 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 400 VUs  00m00.5s/10m0s  10000/10000 iters, 25 per VU